# 实验一 MySQL的安装和使用

## 一、使用docker安装mysql容器
#### 1、获取mysql镜像
    $ docker pull mysql:5.7
#### 2、建MySQL容器
    $ docker run --name sww_mysql -d -it -p 5432:5432 -e MYSQL_ROOT_PASSWORD=root mysql:5.7
#### 3、进入容器
    $ docker exec -it sww_mysql bash
#### 4、进入MySQL
    $ mysql -h localhost -u root -p
    输入密码root

## 二、使用MySQL
#### 1、创建并使用数据库
    > create database mysqltest;      
    > use mysqltest;
#### 2、创建表并查看

    > create table student(  
       id  int(11),  
       name  varchar(20),   
       age int(11)  
      );  
    > show tables;  
    +----------------------+  
    | Tables\_in_mysqltest |  
    +----------------------+  
    | student              |  
    +----------------------+  
    > desc student;   
    +-------+-------------+------+-----+---------+-------+  
    | Field | Type        | Null | Key | Default | Extra |  
    +-------+-------------+------+-----+---------+-------+  
    | id    | int(11)     | YES  |     | NULL    |       |  
    | name  | varchar(20) | YES  |     | NULL    |       |  
    | age   | int(11)     | YES  |     | NULL    |       |  
    +-------+-------------+------+-----+---------+-------+  
#### 3、插入数据
    > INSERT INTO student ( id, name, age ) VALUES ( 2, "zhangsan", 20 );
#### 4、删除数据
    > DELETE FROM student WHERE id=1;
#### 5、查询数据
    > select * from student;
#### 6、更新数据
    > UPDATE student SET age=18 WHERE id=2;
#### 7、删除表
    > DROP TABLE student;

## 三、建立一个student表和student_info表，并查询一个学生对应的student_info信息
#### 1、创建学生表 （学号，姓名，性别，年龄，电话）
    > CREATE TABLE STUDENT(  
       SID     BIGINT  UNSIGNED PRIMARY KEY  AUTO_INCREMENT,  
       NAME    VARCHAR(40),  
       SEX     VARCHAR(10)  DEFAULT 'male' CHECK(SEX IN ('male','female')),  
       AGE     INT  UNSIGNED,  
       TEL     BIGINT  UNSIGNED  
      )engine=InnoDB default charset=utf8 auto_increment=1;  
    > desc STUDENT;   
    +-------+---------------------+------+-----+---------+----------------+  
    | Field | Type                | Null | Key | Default | Extra          |  
    +-------+---------------------+------+-----+---------+----------------+  
    | SID   | bigint(20) unsigned | NO   | PRI | NULL    | auto_increment |  
    | NAME  | varchar(40)         | YES  |     | NULL    |                |  
    | SEX   | varchar(10)         | YES  |     | male    |                |  
    | AGE   | int(10) unsigned    | YES  |     | NULL    |                |  
    | TEL   | bigint(20) unsigned | YES  |     | NULL    |                |  
    +-------+---------------------+------+-----+---------+----------------+  
#### 2、创建学生信息表（学号，英语、数学、语文、综合成绩）
    > CREATE TABLE STUDENT_INFO(  
       SID BIGINT UNSIGNED PRIMARY KEY  AUTO_INCREMENT,  
       ENGLISH_SCORE INT UNSIGNED NOT NULL,  
       MATH_SCORE INT UNSIGNED NOT NULL,  
       CHINESE_SCORE INT UNSIGNED NOT NULL,  
       COMPREHENSIVE_SCORE INT UNSIGNED NOT NULL  
       )engine=InnoDB default charset=utf8 auto_increment=1;  
    > desc STUDENT_INFO;  
    +---------------------+---------------------+------+-----+---------+----------------+  
    | Field               | Type                | Null | Key | Default | Extra          |  
    +---------------------+---------------------+------+-----+---------+----------------+   
    | SID                 | bigint(20) unsigned | NO   | PRI | NULL    | auto_increment |  
    | ENGLISH_SCORE       | int(10) unsigned    | NO   |     | NULL    |                |  
    | MATH_SCORE          | int(10) unsigned    | NO   |     | NULL    |                |  
    | CHINESE_SCORE       | int(10) unsigned    | NO   |     | NULL    |                |  
    | COMPREHENSIVE_SCORE | int(10) unsigned    | NO   |     | NULL    |                |  
    +---------------------+---------------------+------+-----+---------+----------------+  
#### 3、添加学生信息表对学生表学号的外键
    > ALTER TABLE STUDENT_INFO  
      ADD CONSTRAINT INFO_STUDENT FOREIGN KEY(SID)  
      REFERENCES STUDENT(SID) ON DELETE  CASCADE ON UPDATE CASCADE;  
#### 4、学生表插入数据
    > INSERT INTO STUDENT(SID,NAME,SEX,AGE,TEL) VALUES (202121081001,'shiweiwei','female',23,13086652910);  
    > INSERT INTO STUDENT(SID,NAME,SEX,AGE,TEL) VALUES (202121081002,'huangqizhi','male',22,13086651123);  
    > INSERT INTO STUDENT(SID,NAME,SEX,AGE,TEL) VALUES (202121081003,'zhangtingyi','male',21,13256384412);  
    > INSERT INTO STUDENT(SID,NAME,SEX,AGE,TEL) VALUES (202121081004,'tangyiheng','male',22,15623568854);   
    > SELECT * FROM STUDENT;  
    +--------------+-------------+--------+------+-------------+  
    | SID          | NAME        | SEX    | AGE  | TEL         |  
    +--------------+-------------+--------+------+-------------+  
    | 202121081001 | shiweiwei   | female |   23 | 13086652910 |  
    | 202121081002 | huangqizhi  | male   |   22 | 13086651123 |  
    | 202121081003 | zhangtingyi | male   |   21 | 13256384412 |  
    | 202121081004 | tangyiheng  | male   |   22 | 15623568854 |  
    +--------------+-------------+--------+------+-------------+  
#### 5、学生信息表插入数据
    > INSERT INTO STUDENT_INFO (SID,ENGLISH_SCORE,MATH_SCORE,CHINESE_SCORE,COMPREHENSIVE_SCORE) VALUES    (202121081001,130,137,114,210);  
    > INSERT INTO STUDENT_INFO (SID,ENGLISH_SCORE,MATH_SCORE,CHINESE_SCORE,COMPREHENSIVE_SCORE) VALUES(202121081002,135,133,120,230);  
    > INSERT INTO STUDENT_INFO (SID,ENGLISH_SCORE,MATH_SCORE,CHINESE_SCORE,COMPREHENSIVE_SCORE) VALUES(202121081003,124,140,120,234);  
    > INSERT INTO STUDENT_INFO (SID,ENGLISH_SCORE,MATH_SCORE,CHINESE_SCORE,COMPREHENSIVE_SCORE) VALUES(202121081004,138,139,122,250);  
    > SELECT * FROM STUDENT_INFO;  
    +--------------+---------------+------------+---------------+---------------------+  
    | SID          | ENGLISH_SCORE | MATH_SCORE | CHINESE_SCORE | COMPREHENSIVE_SCORE |  
    +--------------+---------------+------------+---------------+---------------------+  
    | 202121081001 |           130 |        137 |           114 |                 210 |  
    | 202121081002 |           135 |        133 |           120 |                 230 |  
    | 202121081003 |           124 |        140 |           120 |                 234 |  
    | 202121081004 |           138 |        139 |           122 |                 250 |  
    +--------------+---------------+------------+---------------+---------------------+  
#### 6、连接两个表
    > SELECT * FROM STUDENT JOIN STUDENT_INFO USING (SID);  
    +--------------+-------------+--------+------+-------------+---------------+------------+---------------+---------------------+  
    | SID          | NAME        | SEX    | AGE  | TEL         | ENGLISH_SCORE | MATH_SCORE | CHINESE_SCORE | COMPREHENSIVE_SCORE |  
    +--------------+-------------+--------+------+-------------+---------------+------------+---------------+---------------------+  
    | 202121081001 | shiweiwei   | female |   23 | 13086652910 |           130 |        137 |           114 |                 210 |  
    | 202121081002 | huangqizhi  | male   |   22 | 13086651123 |           135 |        133 |           120 |                 230 |  
    | 202121081003 | zhangtingyi | male   |   21 | 13256384412 |           124 |        140 |           120 |                 234 |  
    | 202121081004 | tangyiheng  | male   |   22 | 15623568854 |           138 |        139 |           122 |                 250 |  
    +--------------+-------------+--------+------+-------------+---------------+------------+---------------+---------------------+  

## 四、MySQL架构
MySQL 在整体架构上分为 Server 层和存储引擎层。  
Server 层，包括连接器、查询缓存、分析器、优化器、执行器等，存储过程、触发器、视图和内置函数都在这层实现。  
存储引擎层负责数据的存储和提取，如 InnoDB、MyISAM、Memory 等引擎。  
在客户端连接到 Server 层后，Server 会调用数据引擎提供的接口，进行数据的变更。  
![MySQL整体架构图](images/s1.png)  

## 遇到的问题：
> MySQL内无法输入中文  
解决：进入Docker容器时设置系统的字符集为C.UTF-8 
`docket exec -it 容器id env LANG=C.UTF-8 bash`

# 实验二 MongoDB的安装和使用
### 一、MongoDB 官方入门课程 M001前两章的学习笔记
1. mongodb是一个NoSQL文档数据库。

2. NoSQL：任何不以关系型数据库的方法存储数据的数据库；这意味着你以有组织的方式存储数据，但不是按行和列存储。

3. 文档：一种将数据组织和存储为一组<字段，值>对的方法。

4. 集合：有组织地存储有着通用字段的文档。

5. Atlas：云数据库，为以mongodb为核心的各种应用程序而构建的完全托管的数据库。

6. 创建和部署一个atlas集群。

7. BSON：二进制的json；mongodb在内部和网络以BSON格式存储数据；但是，你可以在json中表示的任何内容，都可以本地存储在MongoDB中，并且可以在json中轻松搜索；即以BSON的格式存储，以JSON的格式查看。

8. 导入和导出数据：
	* mongoimport：`mongoimport --uri "<Atlas Cluster URI>"  --drop=<filename>.json`
	    从json文件中导入数据
	
	* mongoexport：`mongoexport --uri "<Atlas Cluster URI>"  --collection=<collection name> --out=<filename>.json`
	    以JSON格式导出数据
	
	* mongorestore：`mongorestore --uri "<Atlas Cluster URI>" --drop dump`
	    从BSON文件导入数据
	
	* mongodump: `mongodump --uri "<Atlas Cluster URI>"` 
	    以BSON格式导出数据
	
9.  查询数据：
	* 连接admin数据库：`mongo "mongodb+srv://m001-student:m001-mongodb-basics@sandbox.z81nm.mongodb.net/admin"`
	* 显示集群中的数据库列表：`show dbs`
	* 选择想使用的数据库：`use <数据库名>`
	* 查看数据库中的集合：`show collections`
	* 查询指定集合：`db.<collection name>.find(<query>)`
	* `it`命令：“iterate”，it允许我们遍历find查询命令返回的对象。
	* 统计符合条件的文档的数量：`db.<collection name>.find(<query>).count()`
	* 使结果界面更美观：`db.<collection name>.find(<query>).pretty()`
	* find的空查询指令：`db.<collection>.find({})`：展示集合的前20个文档（随机的顺序）
	* 实验记录：
		```sql
		1. mongo "mongodb+srv://m001-student:m001-mongodb-basics@sandbox.z81nm.mongodb.net/admin"
		2. show dbs
		3. use sample_training
		4. show collections
		5. db.zips.find({"state": "NY"})
		6. db.zips.find({"state": "NY"}).count()
		7. db.zips.find({"state": "NY", "city": "ALBANY"})
		8. db.zips.find({"state": "NY", "city": "ALBANY"}).pretty()
		```

### 二、安装MongoDB数据库
#### 官网安装教程，在ubuntu20.04操作系统上进行
1. 安装mongodb的公钥：`wget -qO - https://www.mongodb.org/static/pgp/server-5.0.asc | sudo apt-key add -`
2. 创建一个list文件：`echo "deb http://repo.mongodb.org/apt/debian buster/mongodb-org/5.0 main" | sudo tee /etc/apt/sources.list.d/mongodb-org-5.0.list`
3. 重新加载系统的包数据库：`sudo apt-get update`
4. 安装MongoDB的最新版本：`sudo apt-get install -y mongodb-org`
5. 启动mongod：`sudo service mongod start`

#### docker安装MongoDB容器（推荐）
1. 创建mongodb容器：`docker run -itd --name ztyMongoDB -p 57017:27017 mongo --auth`
	参数：--auth：需要密码才能访问容器服务。
2. 进入容器：`docker exec -it ztyMongoDB mongo admin`
3. 创建一个admin用户和密码：`db.createUser({ user:'admin',pwd:'123456',roles:[ { role:'userAdminAnyDatabase', db: 'admin'},"readWriteAnyDatabase"]});`
4. 创建一个root用户：`db.createUser({user:"root",pwd:"root",roles:["root"]})`
5. 使用上面创建的用户信息进行连接:`db.auth('admin', '123456')`

### 三、MongoDB的基本概念
1. 和MySQL进行对比：
![](./images/01.png)

2. MySQL中的表格和MongoDB中的集合对比：
![](./images/02.png)

3. MySQL的数据库服务端和客户端
![](./images/03.png)

### 四、MongoDB的基本使用
#### 1、数据库
##### （1）创建数据库
`use DATABASE_NAME`：如果数据库不存在，则创建数据库，否则切换到指定数据库。但是刚创建的数据库并不在数据库的列表中，要显示它，需要向该数据库插入一些数据。
##### （2）查看数据库
`show dbs`：查看所有的数据库
`db`：查看当前正在使用的数据库
##### （3）删除数据库
`db.dropDatabase()`：删除当前数据库，你可以使用`db`命令查看当前数据库名。
#### 2、集合
##### （1）创建集合
`db.createCollection(name, options)`：name为要创建的集合名称；options为可选参数, 指定有关内存大小及索引的选项。
当你插入一些文档时，如果指定的集合不存在，MongoDB会自动根据你指定的集合名创建集合，具体请看实验记录。
##### （2）查看集合
`show collections`: 查看当前数据库有哪些集合
##### （3）删除集合
`db.collection.drop()`：如果成功删除选定集合，则 drop() 方法返回 true，否则返回 false。
#### 3、文档
##### （1）插入文档
`db.COLLECTION_NAME.insert(document)`:
`db.collection.insertOne(document)`:用于向集合插入一个新文档
`db.collection.insertMany(document)`:用于向集合插入一个或多个文档
##### （2）更新文档
`db.collection.update(<query>,<update>,)`:更新已存在的文档,query是update的查询条件；update为update的对象和一些更新的操作符（如$,$inc...）等；
`db.collection.save(<document>)`:通过传入的文档来替换已有文档，新文档的_id和旧文档的_id有相同的就是更新，不存在相同的就插入。
##### （3）删除文档
`db.collection.remove(<query>)`：query指定删除的文档的条件。
##### （4）查询文档
`db.collection.find(query, projection)`：query(可选)使用查询操作符指定查询条件; projection(可选)使用投影操作符指定返回的键,查询时返回文档中所有键值， 只需省略该参数即可（默认省略）。
`db.col.find().pretty()`：以易读的方式来读取数据
#### 4、实验记录
```sql
* 创建数据库
1. use student
2. db #显示当前数据库为student
3. show dbs #然而数据库列表中没有student
4. db.student.insert({"name":"zhangsan"}) #向student数据库插入一个文档
5. show dbs #数据库列表中出现了student

* 删除数据库
1. db #查看当前正在使用的数据库，显示为student数据库
2. db.dropDatabase() #删除数据库student，显示权限不够
3. db.auth('root','root') #换成root用户
4. use student
5. db.dropDatabase() #成功删除
6. show dbs #列表中无student

* 创建集合
1. use test #选择test数据库
2. db.createCollection('student') #创建student集合
3. show collections #有student数据集
4. db.test.insert({"name" : "zty"}) #自动在test数据库中创建test集合
5. show collections #有test集合

* 删除集合
1. show collections #显示student和test集合
2. db.test.drop() #删除test集合，返回true
3. show collections #只显示了student集合

* 插入文档
1. db.student.insert({'name':'zhangsan'}) #向student集合插入一个文档
2. db.student.find() #查看已插入的文档

* 更新文档
1. db.student.insert({'name':'lisi','age':14}) #插入新的文档，增加字段age
2. db.student.find() #显示集合中所有文档，发现之前的zhangsan没有age
3. db.student.update({'name':'zhangsan'},{$set:{'age':15}}) #找到zhangsan所在文档，并更新age字段的值
4. db.student.find() #都有age

* 删除文档
1. db.student.find()  #查看集合所有文档
2. db.student.remove({'name':'zhangsan'}) #删除zhangsan的文档
3. db.student.find()  #查看集合所有文档，发现没有zhangsan的文档

* 查询文档
1. db.student.find().pretty() #查询了集合student中的所有文档
2. db.student.find({'name':'lisi'}) #一个查询条件
3. db.student.find({'name':'lisi','age':14}) #两个查询条件的AND操作
4. db.student.find({$or:[{'name':'lisi'},{'age':15}]}) #两个查询条件的OR操作

```

### 五、遇到的问题
* 使用MongoDB官网安装教程在Ubuntu/Debian容器中安装时，在进行到最后一步时，即执行命令`sudo service mongod start`时，返回：`mongod: unrecognized service`。
	* 解决方法：启动`/usr/bin/mongod --config /etc/mongod.conf`，停止`/usr/bin/mongod --config /etc/mongod.conf --shutdown`
### 六、TODO
* 学习正则.


# 实验三 Redis的安装和使用

Redis 是一种使用 C 语言编写的高性能内存数据库，支持持久化到磁盘，其中存储的数据模型为 Key Value 的键值对。

![image-20210910144604974.png](images/t1.png)

## **一、配置实验环境：使用 Docker 安装 Redis**

> Docker 是一种虚拟化技术，基于 Linux 的容器机制（Linux Containers，简称 LXC），你可以把它近似地理解成是一个“轻量级的虚拟机”，只消耗较少的资源就能实现对进程的隔离保护。使用 Docker 可以把应用程序和它相关的各种依赖（如底层库、组件等）“打包”在一起，这就是 Docker 镜像（Docker image）。Docker 镜像可以让应用程序不再顾虑环境的差异，在任意的系统中以容器的形式运行（当然必须要基于 Docker 环境），极大地增强了应用部署的灵活性和适应性。因此，使用 Docker 搭建实验环境，可以最小化环境配置。

1. 在 Docker Hub 中搜索 Redis 镜像文件

第一种方式是上 Docker Hub 的官网仓库搜索：

![image-20210910143959353.png](images/t2.png)

第二种方式是通过终端命令搜索：

```
docker search redis
```

![image-20210910141512101.png](images/t3.png)

一般选择这种官方提供的镜像文件，比较安全。

1. 从 Docker Hub 拉取官方的最新版本的镜像文件

```
docker pull redis:latest
```

1. 查看本地镜像

```
docker images
```

1. 运行容器

```
docker run -itd --name redis -p 6379:6379 redis
```

1. 查看运行中的容器

```
docker ps
```

1. 在运行中的容器内部执行命令

```
docker exec -it --name redis /bin/bash
```

1. 在容器内部通过 `redis-cli`命令 连接测试使用 redis 服务

```
redis-cli
```

## **二、实验记录：测试 Redis 的基本操作**

### **字符串（String）**

Redis 字符串数据类型的相关命令用于管理 redis 字符串值。

- `SET key value`：设置指定 key 的值

    ```
    127.0.0.1:6379> set test 1
    OK
    127.0.0.1:6379> set test redis
    OK
    ```

- `GET key`：获取指定 key 的值

    ```
    127.0.0.1:6379> get test
    "redis"
    ```

- `GETRANGE key start end`：返回 key 中字符串值的子字符

    ```
    127.0.0.1:6379> getrange test 0 1
    "re"
    ```

- `GETSET key value`：将给定 key 的值设为 value ，并返回 key 的旧值(old value)

    ```
    127.0.0.1:6379> get test
    "redis"
    127.0.0.1:6379> getset test redis-getset
    "redis"
    127.0.0.1:6379> get test
    "redis-getset"
    ```

- `MGET key1 [key2..]`：获取所有(一个或多个)给定 key 的值

    ```
    127.0.0.1:6379> get test
    "redis-getset"
    127.0.0.1:6379> set test2 test2
    OK
    127.0.0.1:6379> get test2
    "test2"
    127.0.0.1:6379> mget test test2
    1) "redis-getset"
    2) "test2"
    ```

- `STRLEN key`：返回 key 所储存的字符串值的长度

    ```
    127.0.0.1:6379> get test
    "redis-getset"
    127.0.0.1:6379> strlen test
    (integer) 12
    ```

- `MSET key value [key value ...]`：同时设置一个或多个 key-value 对。

    ```
    127.0.0.1:6379> mset k1 v1 k2 v2
    OK
    127.0.0.1:6379> mget k1 k2
    1) "v1"
    2) "v2"
    ```

- `INCR key`：将 key 中储存的数字值增一。

    ```
    127.0.0.1:6379> get k3
    (integer) 1
    127.0.0.1:6379> incr k3
    (integer) 2
    ```

- `INCRBY key increment`：将 key 所储存的值加上给定的增量值（increment）。

    ```
    127.0.0.1:6379> incrby k3 10
    (integer) 12
    ```

- `DECR key`：将 key 中储存的数字值减一。

    ```
    127.0.0.1:6379> decr k3
    (integer) 11
    ```

- `DECRBY key decrement`：key 所储存的值减去给定的减量值（decrement）。

    ```
    127.0.0.1:6379> decrby k3 10
    (integer) 1
    ```

- `APPEND key value`：如果 key 已经存在并且是一个字符串， APPEND 命令将指定的 value 追加到该 key 原来值（value）的末尾。

    ```
    127.0.0.1:6379> append test test_append
    (integer) 23    # 追加后的字符串长度
    127.0.0.1:6379> get test
    "redis-getsettest_append"
    ```

- ...

### **哈希（Hash）**

Redis hash 是一个 string 类型的 **field（字段） 和 value（值） 的映射表**，hash 特别适合用于存储对象。

- `HSET key field value`：将哈希表 key 中的字段 field 的值设为 value。

    ```
    127.0.0.1:6379> hset myhash field1 "foo"
    (integer) 1     # 新添加未存在的 key value 键值对会返回 1
    127.0.0.1:6379> hset myhash field1 "bar"
    (integer) 0     # 覆盖已有的 key 的 value 会返回 0
    127.0.0.1:6379> hset myhash field2 "foo"
    (integer) 1
    ```

- `HGET key field`：获取存储在哈希表中指定字段的值。

    ```
    127.0.0.1:6379> hget myhash field1
    "bar"
    127.0.0.1:6379> hget myhash field2
    "foo"
    ```

- `HEXISTS key field`：查看哈希表 key 中，指定的字段是否存在。

    ```
    127.0.0.1:6379> hexists myhash field1
    (integer) 1     # 哈希表中存在该字段返回 1
    127.0.0.1:6379> hexists myhash field2
    (integer) 1
    127.0.0.1:6379> hexists myhash field3
    (integer) 0     # 哈希表中不存在该字段则返回 0
    ```

- `HDEL key field1 [field2]`：删除一个或多个哈希表字段。

    ```
    127.0.0.1:6379> hdel myhash field1
    (integer) 1     # 删除存在的字段返回 1
    127.0.0.1:6379> hdel myhash field3
    (integer) 0     # 删除不存在的字段则返回 1
    ```

- `HGETALL key`：获取在哈希表中指定 key 的所有字段和值。

    ```
    127.0.0.1:6379> hset myhash field1 "foo"
    (integer) 1
    127.0.0.1:6379> hset myhash field2 "bar"
    (integer) 0
    127.0.0.1:6379> hgetall myhash
    1) "field1"
    2) "foo"
    3) "field2"
    4) "bar"
    ```

- `HKEYS key`：获取所有哈希表中的字段。

    ```
    127.0.0.1:6379> hkeys myhash
    1) "field2"
    2) "field1"
    ```

- `HLEN key`：获取哈希表中字段的数量。

    ```
    127.0.0.1:6379> hlen myhash
    (integer) 2
    ```

- ...

### **列表（List）**

Redis列表是简单的**字符串列表**，按照插入顺序排序。你可以添加一个元素到列表的头部（左边）或者尾部（右边）。

- `LINSERT key BEFORE|AFTER pivot value`：在列表的元素前或者后插入元素。
- `LPUSH key value1 [value2]`：将一个或多个值插入到列表头部。
`RPUSH key value1 [value2]`：将一个或多个值插入到列表尾部。

    ```
    127.0.0.1:6379> lpush mylist v1
    (integer) 1
    127.0.0.1:6379> lpush mylist v2
    (integer) 2
    127.0.0.1:6379> rpush mylist v3
    (integer) 3
    ```

- `LRANGE key start stop`：获取列表指定范围内的元素。

    ```
    127.0.0.1:6379> lrange mylist 0 2 # 索引下标从0开始，左右闭集
    1) "v2"
    2) "v1"
    3) "v3"
    ```

- `LPOP key`：移出并获取列表的第一个元素。
`RPOP key`：移出并获取列表的最后一个元素。

    ```
    127.0.0.1:6379> lpop mylist
    "v2"
    127.0.0.1:6379> rpop mylist
    "v3"
    ```

- `LLEN key`：获取列表长度。

    ```
    127.0.0.1:6379> llen mylist
    (integer) 1
    ```

- `BLPOP key1 [key2 ] timeout`：移出并获取列表的第一个元素， 如果列表没有元素会阻塞列表直到等待超时或发现可弹出元素为止。
- `BRPOP key1 [key2 ] timeout`：移出并获取列表的最后一个元素， 如果列表没有元素会阻塞列表直到等待超时或发现可弹出元素为止。
- `BRPOPLPUSH source destination timeout`：从列表中弹出一个值，将弹出的元素插入到另外一个列表中并返回它； 如果列表没有元素会阻塞列表直到等待超时或发现可弹出元素为止。
- ...

### **集合（Set）**

Redis 的 Set 是 String 类型的**无序集合**。**集合成员是唯一的**，这就意味着集合中不能出现重复的数据。

Redis 中集合是通过哈希表实现的，所以添加，删除，查找的复杂度都是 `O(1)`。

集合还擅长做并集、交集、差集等集合运算。

- `SADD key member1 [member2]`：向集合添加一个或多个成员。

    ```
    127.0.0.1:6379> sadd myset m1 m2 m3
    (integer) 3     # 返回成功插入集合的元素个数
    127.0.0.1:6379> sadd myset m4
    (integer) 1
    ```

- `SCARD key`：获取集合的成员数。

    ```
    127.0.0.1:6379> scard myset
    (integer) 4
    ```

- `SMEMBERS key`：返回集合中的所有成员。

    ```
    127.0.0.1:6379> smembers myset
    1) "m1"
    2) "m2"
    3) "m3"
    4) "m4"
    127.0.0.1:6379> smembers myset2
    1) "m3"
    2) "m5"
    3) "m4"
    ```

- `SUNION key1 [key2]`：返回所有给定集合的并集。

    ```
    127.0.0.1:6379> sunion myset myset2
    1) "m3"
    2) "m4"
    3) "m1"
    4) "m2"
    5) "m5"
    ```

- `SDIFF key1 [key2]`：返回第一个集合与其他集合之间的差集。

    ```
    127.0.0.1:6379> sdiff myset myset2
    1) "m1"
    2) "m2"
    ```

- `SINTER key1 [key2]`：返回给定所有集合的交集。

    ```
    127.0.0.1:6379> sinter myset myset2
    1) "m3"
    2) "m4"
    ```

- `SISMEMBER key member`：判断 member 元素是否是集合 key 的成员。

    ```
    127.0.0.1:6379> sismember myset m1
    (integer) 1     # 包含则返回 1
    127.0.0.1:6379> sismember myset m5
    (integer) 0     # 不包含则返回 0
    ```

- ...

### **有序集合（zset: sorted set）**

Redis **有序集合**和集合一样也是 string 类型元素的集合，且**不允许重复**的成员。每个元素都会关联一个 double 类型的分数 score。redis 正是通过分数来为集合中的成员进行从小到大的排序。

- `ZADD key score1 member1 [score2 member2]`：向有序集合添加一个或多个成员，或者更新已存在成员的分数。

    ```
    127.0.0.1:6379> ZADD runoobkey 1 redis
    (integer) 1
    127.0.0.1:6379> ZADD runoobkey 2 mongodb
    (integer) 1
    127.0.0.1:6379> ZADD runoobkey 3 mysql
    (integer) 1
    127.0.0.1:6379> ZADD runoobkey 3 mysql
    (integer) 0
    127.0.0.1:6379> ZADD runoobkey 4 mysql
    (integer) 0
    ```

- `ZRANGE key start stop [WITHSCORES]`：通过索引区间返回有序集合指定区间内的成员。

    ```
    127.0.0.1:6379> ZRANGE runoobkey 0 10 WITHSCORES
    1) "redis"
    2) "1"
    3) "mongodb"
    4) "2"
    5) "mysql"
    6) "4"
    ```

- `ZCARD key`：获取有序集合的成员数。

    ```
    127.0.0.1:6379> ZCARD runoobkey
    (integer) 3
    ```

- `ZREVRANK key member`：返回有序集合中指定成员的排名，有序集成员按分数值递减(从大到小)排序。

    ```
    127.0.0.1:6379> ZREVRANK runoobkey redis
    (integer) 2
    127.0.0.1:6379> ZREVRANK runoobkey mongodb
    (integer) 1
    127.0.0.1:6379> ZREVRANK runoobkey mysql
    (integer) 0
    ```

- ...

### **各种数据类型的使用场景**

[Untitled](https://www.notion.so/2dc99cf7733c4df0b98963c6aa9ff73f)

## **三、了解 Redis 的架构模式**

### **单机模式**

![image-20200901193057781.png](images/t4.png)

单机模式顾名思义就是只安装一个 Redis，启动起来，业务调用即可。例如一些简单的应用，并非必须保证高可用的情况下可以使用该模式。单机 Redis 能够承载的 QPS（每秒查询速率）大概在几万左右。假设上千万、上亿用户同时访问 Redis，QPS 达到 10 万+。这些请求过来，单机 Redis 直接就挂了。系统的瓶颈就出现在 Redis 单机问题上，此时我们可以通过**主从复制**解决该问题，实现系统的高并发。

### **主从复制**

![image-20200901192831745.png](images/t5.png)

Redis 的**复制（Replication）**功能允许用户根据一个 Redis 服务器来创建任意多个该服务器的复制品，其中被复制的服务器为**主服务器（Master）**，而通过复制创建出来的复制品则为**从服务器（Slave）**。 只要主从服务器之间的网络连接正常，主服务器就会将写入自己的数据**同步更新**给从服务器，从而保证主从服务器的数据相同。

数据的复制是**单向**的，只能由主节点到从节点，简单理解就是**从节点只支持读操作**，不允许写操作。主要是读高并发的场景下用主从架构。主从模式需要考虑的问题是：当 Master 节点宕机，需要**选举**产生一个新的 Master 节点，从而保证服务的高可用性。

### **哨兵模式**

![image-20200902140230350.png](images/t6.png)

主从模式中，当主节点**宕机**之后，从节点是可以作为主节点顶上来继续提供服务，但是需要修改应用方的主节点地址，还需要命令所有从节点去复制新的主节点，整个过程需要人工干预。

于是，在 Redis 2.8 版本开始，引入了**哨兵（Sentinel）**这个概念，在**主从复制的基础**上，哨兵实现了**自动化故障恢复**。

Sentinel（哨兵）是Redis 的**高可用**性解决方案：由一个或多个Sentinel 实例组成的 Sentinel 系统可以监视任意多个主服务器，以及这些主服务器属下的所有从服务器，并在被监视的主服务器进入下线状态时，自动将下线主服务器属下的某个从服务器升级为新的主服务器。

## **四、了解 Redis 的使用场景**

Redis 适合的场景：

- 存储用户信息（比如会话）、配置文件、参数、购物车等等，并且这些信息都和用户 ID 挂钩，所以我们可以通过 KV 数据库来存储用户的 ID 作为键，其余用户信息作为对应的值，实现快速检索用户信息。

Redis 不适合的场景如下：

- 需要通过值来查询的场景：KV 数据库只能通过键来查询值，而不能通过值来查询键。
- 需要存储数据之间的关系：KV 数据库不能通过两个或以上的键来关联数据。
- 需要事务的支持：KV 数据库在故障发生时不可以进行回滚。

## **五、TODO**

- Redis 高级数据结构
- 深入了解 Redis 的哨兵机制
- 搭建 Redis 集群
- Redis 持久化机制（AOF & RDB）
- Redis 分布式锁


# 实验四 Janusgraph的安装与使用

[JanusGraph](https://docs.janusgraph.org/)是一个可扩展的图数据库，用于存储和查询分布在多机集群中的包含数千亿顶点和边的图。

### Step1：本地安装 - 安装Java

​	为管理方便在同一个Docker容器中安装四个数据库，选择在服务器Docker容器上进行本地安装。由于容器的image是最小版，没有安装java，所以先安装Java8。

①下载Java8 tar.gz 包：[Java官网](https://www.oracle.com/java/technologies/javase/javase-jdk8-downloads.html).

②解压Java包，配置路径

```bash
mkdir -p /usr/local/java
tar -vzxf jdk-8u241-linux-x64.tar.gz -C /usr/local/java/
```

③添加环境变量

```bash
vim /etc/profile
# 添加入下内容，并保存
export JAVA_HOME=/usr/local/java/jdk1.8.0_241
export CLASSPATH=$:CLASSPATH:$JAVA_HOME/lib/
export PATH=$PATH:$JAVA_HOME/bin
# 重新加载配置文件
source /etc/profile
```

④测试是否安装成功

```bash
> java -version
java version "1.8.0_301"
Java(TM) SE Runtime Environment (build 1.8.0_301-b09)
Java HotSpot(TM) 64-Bit Server VM (build 25.301-b09, mixed mode)
```

### step2：本地安装 - 安装Janusgraph数据库

①下载Janusgraph .zip包并解压，[github下载](https://github.com/JanusGraph/janusgraph/releases).

```bash
mkdir /usr/local/janusgraph
mv janusgraph-0.6.0.zip /usr/local/janusgraph
cd /usr/local/janusgraph
unzip janusgraph-0.6.0.zip
```

②运行Gremlin Console

```bash
> ./gremlin.sh
Sep 11, 2021 8:55:49 AM java.util.prefs.FileSystemPreferences$1 run
INFO: Created user preferences directory.

         \,,,/
         (o o)
-----oOOo-(3)-oOOo-----
SLF4J: Class path contains multiple SLF4J bindings.
SLF4J: Found binding in [jar:file:/usr/local/janusgraph/janusgraph-0.6.0/lib/slf4j-log4j12-1.7.30.jar!/org/slf4j/impl/StaticLoggerBinder.class]
SLF4J: Found binding in [jar:file:/usr/local/janusgraph/janusgraph-0.6.0/lib/logback-classic-1.1.3.jar!/org/slf4j/impl/StaticLoggerBinder.class]
SLF4J: See http://www.slf4j.org/codes.html#multiple_bindings for an explanation.
SLF4J: Actual binding is of type [org.slf4j.impl.Log4jLoggerFactory]
plugin activated: tinkerpop.server
plugin activated: tinkerpop.tinkergraph
08:55:52 WARN  org.apache.hadoop.util.NativeCodeLoader  - Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
plugin activated: tinkerpop.hadoop
plugin activated: tinkerpop.spark
plugin activated: tinkerpop.utilities
plugin activated: janusgraph.imports
gremlin>
```

### step3：Janusgraph连接

①启动服务器

```bash
./janusgraph-server.sh start
# 要传入配置文件作为参数，使用
./janusgraph-server.sh console ./conf/gremlin-server/gremlin-server-[...].yaml
```

服务器的默认端口为8182，可以使用Janusgraph的:remote命令远程连接

```bash
./gremlin.sh
:remote connect tinkerpop.server conf/remote.yaml
# 得到结果：
==>Configured localhost/127.0.0.1:8182
```

### step4：Gremlin语法初见

>Gremlin是 Apache TinkerPop  框架下的图遍历语言。Gremlin是一种函数式数据流语言，可以使得用户使用简洁的方式表述复杂的属性图（property  graph）的遍历或查询。每个Gremlin遍历由一系列步骤（可能存在嵌套）组成，每一步都在数据流（data stream）上执行一个原子操作。

Gremlin Console 本身可以执行一些简单的运算：

![](images/h1.png)

[JanusGraph基础使用教程](https://docs.janusgraph.org/getting-started/basic-usage/)

​	教程中的例子大量使用了一个使用Janusgraph表示的实例图，称为“诸神图”。这个特殊的实例描述了罗马万神殿中存在的人和地点之间的关系。该图（中英文版）如下所示：

#### 原版：

![1](images/h2.png)

#### 中文版：

![2](images/h3.png)

| 标示           | 含义                                       |
| -------------- | ------------------------------------------ |
| 加粗的key      | 图索引键                                   |
| 加粗带星的key  | 必须有唯一值的图索引键                     |
| 带下划线的key  | 以顶点为中心的索引键                       |
| 空心箭头的边   | 函数性的（functional）/独特的边(不能重复） |
| 尾部为十字的边 | 单向边(只能在一个方向建立关系)             |

#### 使用过程：

```bash
graph = JanusGraphFactory.open('conf/janusgraph-inmemory.properties')
==>standardjanusgraph[inmemory:[127.0.0.1]]
# 加载图
gremlin> GraphOfTheGodsFactory.loadWithoutMixedIndex(graph, true)
==>null
gremlin> g = graph.traversal()
==>graphtraversalsource[standardjanusgraph[inmemory:[127.0.0.1]], standard]
```

​	以上`open`和`load`方法在返回新构造的图之前，执行以下操作：

 	1. 在图上创建全局和以顶点为中心的索引集合。
 	2. 将所有顶点及其属性添加到图中。
 	3. 将所有边及其属性添加到图中。

#### 全局图索引：

​	使用图数据库中数据的典型模式是首先使用图索引来确定起始点。该起始点是一个元素（或一组元素） - 即顶点或边。从起始点，Gremlin路径描述了如何通过图结构来遍历图中的其他点。通过name属性上的唯一索引，可以检索到Saturn顶点，然后可以查到它的所有属性值(即Saturn属性的键值对)。如图所示，顶点Saturn的名字是“Saturn”，年龄是10000，类别是“titan”。 Saturn的孙子通过遍历语句可以表示为：“谁是Saturn的孙子？” （“父亲”的反面是“孩子”）。 检索到的结果是Hercules。

```
gremlin> saturn = g.V().has('name', 'saturn').next()
==>v[256]
gremlin> g.V(saturn).valueMap()
==>[name:[saturn], age:[10000]]
gremlin> g.V(saturn).in('father').in('father').values('name')
==>hercules
```

​	属性place也在图索引中。属性place是边的一个属性。因此JanusGraph可以通过图的索引索引到边。它可以查询Gods图中发生在Athens(纬度:37.97, 经度:23.72) 50km范围内的信息。然后通过这些信息查看涉及到哪些顶点。

```
gremlin> g.E().has('place', geoWithin(Geoshape.circle(37.97, 23.72, 50)))
==>e[a9x-co8-9hx-39s][16424-battled->4240]
==>e[9vp-co8-9hx-9ns][16424-battled->12520]
gremlin> g.E().has('place', geoWithin(Geoshape.circle(37.97, 23.72, 50))).as('source').inV().as('god2').select('source').outV().as('god1').select('god1', 'god2').by('name')
==>[god1:hercules, god2:hydra]
==>[god1:hercules, god2:nemean]
```

​	图索引是JanusGraph中的一种索引结构。JanusGraph会自动使用索引来检索满足一个或多个约束条件的所有顶点(g.V)或边(g.E)。JanusGraph中另外一种索引是以顶点为中心的索引。以顶点为中心的索引可以加快图的遍历。

#### 图遍历示例：

​	前面证明了Saturn的孙子是Hercules，这也可以使用循环的方式来查询，实际上Hercules是从Saturn在in(‘father’) 路径上循环两次到达的点。

```
gremlin> hercules = g.V(saturn).repeat(__.in('father')).times(2).next()
==>v[1536]
```

​	Hercules是一个半神半人，为了证明Hercules半神半人，需要查询他父母的起源。可以从Hercules顶点去遍历他的母亲和父亲。最后可以去确定他们的类型是“god”和“human”。

```
gremlin> g.V(hercules).out('father', 'mother')
==>v[1024]
==>v[1792]
gremlin> g.V(hercules).out('father', 'mother').values('name')
==>jupiter
==>alcmene
gremlin> g.V(hercules).out('father', 'mother').label()
==>god
==>human
gremlin> hercules.label()
==>demigod
```

​	到目前为止，这些例子涉及了罗马万神殿中各种人物的遗传关系。 图的属性模型足以表示各种的事物和关系。比如说可以通过Hercules顶点遍历battled边，来发现Hercules参与了雅典附近的两场战争。

```
gremlin> g.V(hercules).out('battled')
==>v[2304]
==>v[2560]
==>v[2816]
gremlin> g.V(hercules).out('battled').valueMap()
==>[name:[nemean]]
==>[name:[hydra]]
==>[name:[cerberus]]
gremlin> g.V(hercules).outE('battled').has('time', gt(1)).inV().values('name')
==>cerberus
==>hydra
```

#### 更复杂的图遍历示例：

Tartarus的同居者

```
gremlin> pluto = g.V().has('name', 'pluto').next()
==>v[2048]
gremlin> // who are pluto's cohabitants?
gremlin> g.V(pluto).out('lives').in('lives').values('name')
==>pluto
==>cerberus
gremlin> // pluto can't be his own cohabitant
gremlin> g.V(pluto).out('lives').in('lives').where(is(neq(pluto))).values('name')
==>cerberus
gremlin> g.V(pluto).as('x').out('lives').in('lives').where(neq('x')).values('name')
==>cerberus
```

Pluto的兄弟

```
gremlin> // where do pluto's brothers live?
gremlin> g.V(pluto).out('brother').out('lives').values('name')
==>sky
==>sea
gremlin> // which brother lives in which place?
gremlin> g.V(pluto).out('brother').as('god').out('lives').as('place').select('god', 'place')
==>[god:v[1024], place:v[512]]
==>[god:v[1280], place:v[768]]
gremlin> // what is the name of the brother and the name of the place?
gremlin> g.V(pluto).out('brother').as('god').out('lives').as('place').select('god', 'place').by('name')
==>[god:jupiter, place:sky]
==>[god:neptune, place:sea]
```

​	最后Pluto居住在Tartarus因为他不在乎死亡。而他的兄弟们根据这些地方的品质来选择他们居住的地方。

```
gremlin> g.V(pluto).outE('lives').values('reason')
==>no fear of death
gremlin> g.E().has('reason', textContains('loves'))
==>e[6xs-sg-m51-e8][1024-lives->512]
==>e[70g-zk-m51-lc][1280-lives->768]
gremlin> g.E().has('reason', textContains('loves')).as('source').values('reason').as('reason').select('source').outV().values('name').as('god').select('source').inV().values('name').as('thing').select('god', 'reason', 'thing')
==>[god:neptune, reason:loves waves, thing:sea]
==>[god:jupiter, reason:loves fresh breezes, thing:sky]
```

-------------

### 遇到的问题

1. 在刚开始按照官方教程加载众神图配置时，遇到如下问题：

```gremlin
gremlin> graph = JanusGraphFactory.open('conf/janusgraph-berkeleyje-es.properties')
Could not execute operation due to backend exception
Type ':help' or ':h' for help.
Display stack trace? [yN]n
```

​	提示由于后端问题无法执行，解决方法：

```bash
# 退出gremlin
gremlin> :exit
# 打开服务器配置
cd ../conf/gremlin-server/
vi gremlin-server.yaml
```

![](images/h4.png)

​	从配置文件中可看出里面只包含了一个`janusgraph-inmemory.properties`的配置。回去查看可用的配置文件：

![](images/h5.png)

​	可以找到`janusgraph-inmemory.properties`这个配置文件，那就直接用这个即可。

![](images/h6.png)

​	可以看到配置文件成功加载了。

​	事实上，教程里是有提那么一嘴的：

![](images/h7.png)

2. 在加载图对象时，若直接使用：

```bash
gremlin> GraphOfTheGodsFactory.load(graph)
```

​	会出现报错：

```bash
The indexing backend with name "search" is not defined. Specify an existing indexing backend or use GraphOfTheGodsFactory.loadWithoutMixedIndex(graph,true) to load without the use of an indexing backend.
Type ':help' or ':h' for help.
Display stack trace? [yN]n
# 使用loadWithoutMixedIndex即可。
gremlin> GraphOfTheGodsFactory.loadWithoutMixedIndex(graph, true)
==>null
```



---------

### TODO

​	进一步学习[Gremlin使用方法](https://docs.janusgraph.org/getting-started/gremlin/)

![](images/h8.png)

