 # 实验环境皆为ubuntu:20.04 + docker:19.03.12
 # 实验一：MySQL的安装和使用
 ## Step1：下载MySQL镜像
 在docker环境中安装MySQL，使用命令
 ```
 docker pull mysql
 ```
 默认为latest版本，
 ## Step2：运行mysql容器
 ```
 docker run -p 3306:3306 --name my_sql -v $PWD/conf:/etc/mysql/conf.d -v $PWD/conf:/etc/mysql/conf.d -v $PWD/logs: -v $PWD/data:/var/lib/mysql -e MYSQL_ROOT_PASSWORD=123456 -d mysql
 ```
 再利用
 ```
 docker ps
 ```
 来查看运行状态
 ## Step3：运行mysql
 
 ```
 docker exec -it 容器ID /bin/bash
 ```
 进入交互运行；

 输入
 ```
 mysql -uroot -p
 ```
 进入mysql
 ## Step4：运行mysql，增、删、改、查
 ```vb
 #创建数据库
 create database dcs_test;

 #新建表格
 create table student(id int(11),name varchar(20),age int(11)); 
 ```
 1、增
 ```vb
 insert into student value(20205200,"zhangsan",23);
 insert into student value(20205201,"lisi",23);
 insert into student value(20205202,"wangwu",24);
 ```

 2、删
 ```vb
 #删除元组
 delete from student where name = "lisi";

 #删除表格
 drop table student;
 ```
 3、改
 ```vb
 update student set age = 24 where id = 20205200;
 ```
 4、查
 ```vb
 select * from student;

#查询结果如下
+----------+----------+------+
| id       | name     | age  |
+----------+----------+------+
| 20205200 | zhangsan |   24 |
| 20205202 | wangwu   |   24 |
+----------+----------+------+

 select id from student where age = 24
 
#查询结果如下
+----------+
| id       |
+----------+
| 20205200 |
| 20205202 |
+----------+
 ```

 ## 遇到的问题：
1、已安装并配置好ssh,但git clone命令选择ssh地址仍然无法克隆到本地，后来切换成https地址才能克隆到本地

 ## TODO：
	
	- 继续熟悉mysql基本操作
 	- 了解并掌握更复杂的mysql操作
	- 深入了解一条mysql语句的执行逻辑等

 # 实验二：MongoDB的安装和使用
 ## Step1：安装mongodb
```
docker pull mongo
```
 ## Step2：启动mongodb镜像
```
docker run -p 27017:27017 -v /tmp/db:/data/db -d mongo
```
 ## Step3：运行mongodb,进行基本的练习
```vb
#运行mongodb
docker exec -it d7055a1d377c mongo
#创建数据库
use prictise
```
1、增
```vb
> db.prictise.insert({name:"zhangsan",age:24})
WriteResult({ "nInserted" : 1 })
> db.prictise.insert({name:"lisi",age:25})
WriteResult({ "nInserted" : 1 })
```
2、查
```vb
> db.prictise.find()
{ "_id" : ObjectId("5f07a97140011b72ab31ade9"), "name" : "zhangsan", "age" : 24 }
{ "_id" : ObjectId("5f07a98540011b72ab31adea"), "name" : "lisi", "age" : 25 }
```
3、改
```vb
> db.prictise.update({name:"zhangsan"},{$set:{age:40}})
WriteResult({ "nMatched" : 1, "nUpserted" : 0, "nModified" : 1 })
> db.prictise.find()
{ "_id" : ObjectId("5f07a97140011b72ab31ade9"), "name" : "zhangsan", "age" : 40 }
{ "_id" : ObjectId("5f07a98540011b72ab31adea"), "name" : "lisi", "age" : 25 }
```
4、删
```vb
#删除文档
> db.prictise.remove({name:"zhangsan"})
WriteResult({ "nRemoved" : 1 })
> db.prictise.find()
{ "_id" : ObjectId("5f07a98540011b72ab31adea"), "name" : "lisi", "age" : 25 }
#删除集合
> db.prictise.drop()
true
```

 ## TODO：
	- 除了shell交互使用数据库，后续尝试使用compass
	- 熟悉掌握基本的mongodb语法及基本操作
 	- 了解并掌握更复杂的mongodb操作


 # 实验三：Redis的安装和使用
 ## Step1：安装redis
 ```
 docker pull redis
 ```
 下载最新版本镜像
 ## Step2：启动镜像
 ```
 docker run -p 6379:6379 -v $PWD/data:/data  -d redis redis-server --appendonly yes
 ```
 ## Step3：运行redis,进行基本数据类型的练习
 ```
 docker exec -it 91c34f37fd39 redis-cli
 ```
 1、string
```vb
#set与get
127.0.0.1:6379> set mykey somevalue
OK
127.0.0.1:6379> get mykey
"somevalue"

#incr与decr
127.0.0.1:6379> set count 100
OK
127.0.0.1:6379> incr count
(integer) 101
127.0.0.1:6379> get count
"101"
127.0.0.1:6379> decr count
(integer) 100
127.0.0.1:6379> get count
"100"

#exists查询键是否存在
127.0.0.1:6379> set mykey Hello
OK
127.0.0.1:6379> exists mykey
(integer) 1
127.0.0.1:6379> del mykey
(integer) 1
127.0.0.1:6379> exists mykey
(integer) 0
```
2、list
```vb
#rpush为右侧插入，类似链表尾插法
#lpush为左侧插入，类似头插法
127.0.0.1:6379> rpush mylist a
(integer) 1
127.0.0.1:6379> rpush mylist b
(integer) 2
127.0.0.1:6379> lpush mylist z
(integer) 3
127.0.0.1:6379> lrange mylist 0 -1
1) "z"
2) "a"
3) "b"
#获取某个元素
127.0.0.1:6379> lindex mylist 2
"b"
```
3、hash
```vb
#实现field-value
127.0.0.1:6379> hmset user:1000 username antirez birthyear 1990
OK
127.0.0.1:6379> hgetall user:1000
1) "username"
2) "antirez"
3) "birthyear"
4) "1990"
#获取键值
127.0.0.1:6379> hmget user:1000 username birthyear
1) "antirez"
2) "1990"
```
4、sets
```vb
#增加数据sadd，随机删除数据spop
127.0.0.1:6379> sadd myset 12 3 4 
(integer) 3
127.0.0.1:6379> spop myset
"3"
#查询所有成员
127.0.0.1:6379> sadd myset 12 3 4
(integer) 3
127.0.0.1:6379> smembers myset
1) "3"
2) "4"
3) "12"
```
5、sorted set
```vb
#增加数据
127.0.0.1:6379> zadd hackers 1940 "Alan"
(integer) 1
127.0.0.1:6379> zadd hackers 1957 "Sophie"
(integer) 1
127.0.0.1:6379> zadd hackers 1953 "Richard"
(integer) 1
127.0.0.1:6379> zadd hackers 1949 "Anita"
(integer) 1
127.0.0.1:6379> zadd hackers 1912 "Turing"
(integer) 1

#排序
127.0.0.1:6379> zrange hackers 0 -1
1) "Turing"
2) "Alan"
3) "Anita"
4) "Richard"
5) "Sophie"
#逆序
127.0.0.1:6379> zrevrange hackers 0 -1
1) "Sophie"
2) "Richard"
3) "Anita"
4) "Alan"
5) "Turing"
```

 ## TODO：
	- 继续熟悉redis基本操作
 	- 了解并掌握更复杂的redis操作
	- 深入了解redis内部执行逻辑
 # 实验四：Janusgraph的安装和使用
 ## 根据官方文档步骤操作学习
 ## 环境为java8
 ## Step1：安装janusgraph
```
unzip janusgraph-full-0.5.2.zip
```

 ## Step2：启动janusgraph


1、运行gremlin服务器
```
$ ./bin/gremlin-server.sh start
Server started 39197.
```
2、运行gremlin控制台，并链接服务器
```vb
#启动控制台
$ ./bin/gremlin.sh
#连接服务器
gremlin> :remote connect tinkerpop.server conf/remote.yaml
==>Configured localhost/127.0.0.1:8182
```
 ## Step3：在gremlin控制台练习官方示例
```vb
#加载图
gremlin> graph = JanusGraphFactory.open('conf/janusgraph-inmemory.properties')
==>standardjanusgraph[inmemory:[127.0.0.1]]
gremlin> GraphOfTheGodsFactory.loadWithoutMixedIndex(graph, true)
==>null
#获取诸神关系实例
gremlin> g = graph.traversal()
==>graphtraversalsource[standardjanusgraph[inmemory:[127.0.0.1]], standard]
```
[graph-of-the-gods](https://github.com/dongcss/training-plan/blob/master/images/graph-of-the-gods-2.png)

1、获取saturn的顶点索引
```vb
gremlin> saturn = g.V().has('name','saturn').next()
==>v[4176]
```
saturn顶点的具体信息
```vb
gremlin> g.V(saturn).valueMap()
==>[name:[saturn],age:[10000]]
```
in()表示根据指定的father标签访问顶点的in方向的邻接点;
values()表示查询最后节点的名字
```vb
gremlin> g.V(saturn).in('father').in('father').values('name')
==>hercules
```


2、查询Athens方圆50公里发生的事件
```vb
gremlin> g.E().has('place',geoWithin(Geoshape.circle(37.97,23.72,50)))
22:58:27 WARN  org.janusgraph.graphdb.transaction.StandardJanusGraphTx  - Query requires iterating over all vertices [(place geoWithin BUFFER (POINT (23.72 37.97), 0.44966))]. For better performance, use indexes
==>e[4d0-3a8-7x1-37s][4256-battled->4168]
==>e[4r8-3a8-7x1-3bc][4256-battled->4296]
gremlin> g.E().has('place', geoWithin(Geoshape.circle(37.97, 23.72, 50))).as('source').inV().as('god2').select('source').outV().as('god1').select('god1', 'god2').by('name')
22:59:20 WARN  org.janusgraph.graphdb.transaction.StandardJanusGraphTx  - Query requires iterating over all vertices [(place geoWithin BUFFER (POINT (23.72 37.97), 0.44966))]. For better performance, use indexes
==>[god1:hercules,god2:nemean]
==>[god1:hercules,god2:hydra]
```
正常显示结果，但是出现*WARN  org.janusgraph.graphdb.transaction.StandardJanusGraphTx  - Query requires iterating over all vertices [(place geoWithin BUFFER (POINT (23.72 37.97), 0.44966))]. For better performance, use indexes*
百度后发现可以通过强制索引更改配置文件来解决
```vb
force-index=true
storage.batch-loading=true（批量导入）
```

3、通过遍历表达saturn与hercules关系
```vb
gremlin> hercules = g.V(saturn).repeat(__.in('father')).times(2).next()
==>v[4256]
```
4、证明hercules是半人半仙
```vb
#查找父母的顶点
gremlin> g.V(hercules).out('father','mother')
==>v[12368]
==>v[4344]
#显示其父母的姓名
gremlin> g.V(hercules).out('father','mother').values('name')
==>jupiter
==>alcmene
#父母的标签
gremlin> g.V(hercules).out('father','mother').label()
==>god
==>human
#hercules的标签
gremlin> hercules.label()
==>demigod
```
5、hercules参加的战役
```vb
#outE()来查询标签为'battled'且从hercules出度的边的邻接顶点
gremlin> g.V(hercules).outE('battled').has('time', gt(1)).inV().values('name')
==>cerberus
==>hydra
gremlin> g.V(hercules).outE('battled').has('time', gt(1)).inV().values('name').toString()
==>[GraphStep(vertex,[v[4192]]), VertexStep(OUT,[battled],edge), HasStep([time.gt(1)]), EdgeVertexStep(IN), PropertiesStep([name],value)]
```

6、查询pluto的同居者
```vb
gremlin> pluto = g.V().has('name', 'pluto').next()
==>v[12536]
gremlin> g.V(pluto).out('lives').in('lives').values('name')
==>cerberus
==>pluto
#上面查询结果有问题，pluto不可能是本人的同居者
gremlin> g.V(pluto).out('lives').in('lives').where(is(neq(pluto))).values('name')
==>cerberus
gremlin> g.V(pluto).as('x').out('lives').in('lives').where(neq('x')).values('name')
==>cerberus
```
7、查询pluto的兄弟
```vb
gremlin> g.V(pluto).out('brother').out('lives').values('name')
==>sky
==>sea
#每个人居住的地方
gremlin> g.V(pluto).out('brother').as('god').out('lives').as('place').select('god', 'place')
==>[god:v[4280],place:v[4344]]
==>[god:v[4328],place:v[4216]]
#都替换成名字
gremlin> g.V(pluto).out('brother').as('god').out('lives').as('place').select('god', 'place').by('name')
==>[god:jupiter,place:sky]
==>[god:neptune,place:sea]
```

8、每个人选择居住地的原因
```vb
gremlin> g.V(pluto).outE('lives').values('reason')
==>no fear of death
gremlin> g.E().has('reason', textContains('loves'))
23:39:26 WARN  org.janusgraph.graphdb.transaction.StandardJanusGraphTx  - Query requires iterating over all vertices [(reason textContains loves)]. For better performance, use indexes
==>e[3kn-3aw-9hx-3co][4280-lives->4344]
==>e[36l-3c8-9hx-394][4328-lives->4216]
gremlin> g.E().has('reason', textContains('loves')).as('source').values('reason').as('reason').select('source').outV().values('name').as('god').select('source').inV().values('name').as('thing').select('god', 'reason', 'thing')
23:39:42 WARN  org.janusgraph.graphdb.transaction.StandardJanusGraphTx  - Query requires iterating over all vertices [(reason textContains loves)]. For better performance, use indexes
==>[god:jupiter,reason:loves fresh breezes,thing:sky]
==>[god:neptune,reason:loves waves,thing:sea]
```

 ## 遇到的问题：

1、docker安装镜像后无法启动镜像，转为系统安装，后续再次尝试docker运行

2、环境为openjdk-1.8.0，启动gremlin控制台时，出现

`Exception in thread "main" java.awt.AWTError: Assistive Technology not found: org.GNOME.Accessibility.AtkWrapper`

解决方法为，将文件

`/usr/lib/jvm/java-8-openjdk-amd64/jre/lib/accessibility.properties`

注释掉 

`#assistive_technologies=org.GNOME.Accessibility.AtkWrapper`

3、加载图的时候出错
```vb
gremlin> graph = JanusGraphFactory.open('conf/janusgraph-cql-es.properties')
Could not instantiate implementation: org.janusgraph.diskstorage.cql.CQLStoreManager
```
解决方法：默认配置（gremlin-server.yaml）使用自己的内存后端，而不是专用的数据库服务器。默认情况下，不使用搜索后端，也不支持混合索引，应该改成
```vb
graph = JanusGraphFactory.open('conf/janusgraph-inmemory.properties')
```
即可运行

4、运用索引功能时，出现*WARN  org.janusgraph.graphdb.transaction.StandardJanusGraphTx  - Query requires iterating over all vertices [(place geoWithin BUFFER (POINT (23.72 37.97), 0.44966))]. For better performance, use indexes*
百度后发现可以通过强制索引更改配置文件来解决

5、初次安装的是java11，运行服务器会出现warn等语句，后来卸载更换成java8之后正常运行
 ## TODO：
 	- janusgraph使用较为复杂，还没有完全了解基本语法，后续再自己设计案例完成查询
 	- 尝试docker环境下配置并运行janusgraph
	- 对于上述遇到的问题逐个了解并解决